
#include <iostream>// РАКОВИЧ АЛЕКСЕЙ. П43021.
using namespace std;
int main() {
	//2.Даны натуральные числа от 35 до 87. Вывести на консоль те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	//10-30 челятсмя на 5.1.2
	/*int i = 35;
	while (i <= 87) {
		if (i % 7 == 1 || i % 7 == 2 || i % 7 == 5 )cout << 1 << ' ';
		i++;
	}
	cout << endl;

	//1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.
	int x = 10;
	while (x <= 20)
	{
		cout << x * x << endl;
		++x;
	}
	return 0;*/

